Revit 2027 API
ViewSheetSetting.AvailableViews Property
All views that can be printed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ViewSet AvailableViews { get; }
Public ReadOnly Property AvailableViews As ViewSet
	Get
public:
property ViewSet^ AvailableViews {
	ViewSet^ get ();
}
member AvailableViews : ViewSet with get
Property Value
ViewSet
Remarks
Users can select the view/sheet from this view set to printing.
See Also
Reference
ViewSheetSetting Class
Autodesk.Revit.DB Namespace